In [54]:
import pandas as pd

In [55]:
data = pd.read_csv('data_m1.csv')

By default the following values are interpreted as
    NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
    'nan', 'null'.

In [56]:
data

      Name      Marks         Grades
0  Priyang         98  not available
1   Aadhya        NaN             AB
2   Krisha         99     wrong data
3   Vedant         87            NaN
4   Parshv         90             AC
5   Mittal  na values             BA
6  Archana         82             BB

In [62]:
data = pd.read_csv('data_m1.csv',na_values=['not available','wrong data',
                                           'na values'])

In [63]:
data

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0    NaN
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [77]:
data = pd.read_csv('data_m1.csv',na_values={'Grades':['not available',
                                                     'wrong data']})

In [78]:
data

      Name      Marks Grades
0  Priyang         98    NaN
1   Aadhya        NaN     AB
2   Krisha         99    NaN
3   Vedant         87    NaN
4   Parshv         90     AC
5   Mittal  na values     BA
6  Archana         82     BB